Repository: ElitePeam/Origami_IOS
Catalog: NewTest/NewTest/*.lproj/Localizable.strings
Languages: th

# new_ver_avail
source: New Version Available
th: มีเวอร์ชั่นใหม่

# new_ver_avail_txt
source: New version of Origami life is available, Please update to version
th: เวอร์ชั่นใหม่ของ Origami life พร้อมให้ใช้แล้วโปรดอัพเดตเป็นเวอร์ชัน

source: Version
th: เวอร์ชั่น

# title_time
source: Time
th: เวลา

source: In
th: เข้า

source: Out
th: ออก

source: Switch Branch
th: เลือกสาขา

source: Switch Activity
th: เลือกกิจกรรม

# cant_stamp_area
source: Can't stamp, You're not in area.
th: คุณไม่สามารถบันทึกเวลาได้ เนื่องจากอยู่นอกพื้นที่ของสาขา

# stamp_success
source: Your time stamp success.
th: บันทึกเวลาสำเร็จ

# stamp_fail
source: Fail time stamp.
th: บันทึกเวลาผิดพลาด

# no_activity
source: No activity name
th: ไม่มีข้อมูลกิจกรรม

# no_customer
source: No cutomer name
th: ไม่มีข้อมูลลูกค้า

source: Topic
th: หัวข้อ

source: Customer
th: ลูกค้า

source: Start
th: เริ่มต้น

source: End
th: สิ้นสุด

# invaild_type
source: Invaild leave type.
th: การทำประเภทรายการผิดพลาด

# success_time_stamp
source: Time stamp activity success.
th: บันทึกเวลากิจกรรมสำเร็จ

# fail_time_stamp
source: Fail to stamp activity.
th: บันทึกเวลากิจกรรมไม่สำเร็จ

# wrong_location
source: Your current location went wrong. Please check your current location again.
th: ตำแหน่งปัจจุบันของคุณผิดพลาด กรุณาตรวจสอบตำแหน่งปัจจุบันของคุณอีกครั้ง

# title_request_ot
source: Request OT
th: ขอล่วงเวลา

# request_ot_datail
source: Request OT Detail
th: รายละเอียดขอล่วงเวลา

source: Name
th: ชื่อ

# start_request_ot
source: Start date
th: วันที่เริ่มต้น

# end_request_ot
source: End date
th: วันที่สิ้นสุด

source: Reason
th: เหตุผล

source: Me
th: ฉัน

source: Pending
th: รอการอนุมัติ

# approve
source: Approved
th: อนุมัติ

# not_approve
source: Not Approved
th: ไม่อนุมัติ

source: Need Info
th: ต้องการข้อมูลเพิ่มเติม

# wait_delete
source: Wait Approval Delete
th: รอการลบ

source: No status
th: ไม่มีสถานะ

source: ADD
th: เพิ่ม

source: UPDATE
th: อัพเดต

source: LATER
th: ภายหลัง

# add_rq_ot_success
source: Request OT success.
th: ทำการขอล่วงเวลาสำเร็จ

# add_rq_ot_fail
source: Request OT fail.
th: ทำการขอล่วงเวลาไม่สำเร็จ

# update_rq_ot_success
source: Update request OT success.
th: อัพเดตการขอล่วงเวลาสำเร็จ

# update_rq_ot_fail
source: Update request OT fail.
th: อัพเดตการขอล่วงเวลาไม่สำเร็จ

# delete_rq_ot_success
source: Delete request OT success.
th: ลบการขอล่วงเวลาสำเร็จ

# delete_rq_ot_fail
source: Delete request OT fail.
th: ลบการขอล่วงเวลาไม่สำเร็จ

# select_start_time
source: Please select start date and time.
th: เลือกวันที่เริ่มต้นขอล่วงเวลาก่อนทำรายการ

# select_end_time
source: Please select end date and time.
th: เลือกวันที่สิ้นสุดขอล่วงเวลาก่อนทำรายการ

# insert_rq_reason
source: Please insert your reason for request OT.
th: ใส่เหตุผลในการขอล่วงเวลาก่อนทำรายการ

# wrong_time_format
source: Wrong date and time format.
th: รูปแบบวันที่ผิดพลาด กรุณาตรวจสอบอีกครั้ง

# title_work
source: Work
th: ทำงาน

# rq_for_float
source: Request Floating
th: ขอทำงานทดแทน

# float_leave
source: Floating Leave
th: ขอลาทดแทน

source: Used
th: ใช้ไป

source: Remain
th: คงเหลือ

source: Total
th: ทั้งหมด

source: Leave
th: การลา

source: Overall
th: ภาพรวม

source: Add Work
th: เพิ่มการลา

source: Leave type
th: ประเภทการลา

source: Leave date
th: วันที่ลา

# without_pay
source: Leave without pay
th: ลาโดยไม่จ่ายเงิน

source: Note
th: หมายเหตุ

source: Apply
th: ยืนยัน

source: Add leave success.
th: เพิ่มการลาสำเร็จ

# warn_leave_type
source: Please select leave type.
th: กรุณาเลือกประเภทการลาก่อนทำรายการ

# warn_leave_start
source: Please select start date leave.
th: กรุณาเลือกวันที่เริ่มต้นการลาก่อนทำรายการ

# warn_leave_end
source: Please select end date leave.
th: กรุณาเลือกวันที่สิ้นสุดการลาก่อนทำรายการ

# warn_reason
source: Please input your reason.
th: กรุณาใส่เหตุผลของการลาก่อนทำรายการ

# warn_before_day
source: You need to apply leave form before
th: คุณจะต้องทำรายการล่วงหน้า

# warn_past_day
source: You can apply only past
th: คุณสามารถทำรายการย้อนหลังได้เพียง

source: day.
th: วัน

# check_work_time
source: Please check your work time.
th: กรุณาตรวจสอบเวลาการทำงาน

# insert_success
source: Save data complete.
th: บันทึกข้อมูลสำเร็จ

# permission_fail
source: Save data permission incomplete.
th: บันทึกสิทธิ์ไม่สำเร็จ

# insert_fail
source: Save data incomplete.
th: บันทึกข้อมูลไม่สำเร็จ

# not_enough_float
source: Not enough float time availiable.
th: จำนวนชั่วโมงลาชดเชยไม่เพียงพอ

# limit_time_fail
source: You need apply before limit time.
th: จำเป็นจะต้องลาก่อนเวลาที่กำหนด

# before_day_fail
source: You can't apply leave form. Please check leave date request.
th: วันที่ลาไม่ตรงเงื่อนไขการลา

# success_update_float_request
source: Update float request success.
th: อัพเดทการขอทำงานทดแทนสำเร็จ

# success_update_float_leave
source: Update float leave success.
th: อัพเดทการขอลาทดแทนสำเร็จ

# success_update_normal_leave
source: Update work leave success.
th: อัพเดทการลางานสำเร็จ

# fail_update_float_request
source: Fail to update float request.
th: อัพเดทการขอทำงานทดแทนไม่สำเร็จ

# fail_update_float_leave
source: Fail to update float leave.
th: อัพเดทการขอลาทดแทนไม่สำเร็จ

# fail_update_normal_leave
source: Fail to update work leave.
th: อัพเดทการลางานไม่สำเร็จ

# success_delete_float_request
source: Delete float request success.
th: ลบรายการขอทำงานทดแทนสำเร็จ

# success_delete_float_leave
source: Delete float leave success.
th: ลบรายการขอลาทดแทนสำเร็จ

# success_delete_normal_leave
source: Delete leave work success.
th: ลบรายการลางานสำเร็จ

# fail_delete_float_request
source: Fail to delete float request.
th: ลบรายการขอทำงานทดแทนไม่สำเร็จ

# fail_delete_float_leave
source: Fail to delete float leave.
th: ลบรายการขอลาทดแทนไม่สำเร็จ

# fail_delete_normal_leave
source: Fail to delete work leave.
th: ลบรายการลางานไม่สำเร็จ

source: Waiting delete
th: รอการลบ

# title_need
source: Need
th: ต้องการ

source: Baht
th: บาท

source: Check Approve
th: ตรวจสอบสถานะ

# edit_need
source: Edit Needs
th: แก้ไขรายการ

# delete_need
source: Delete Needs
th: ลบรายการ

source: Person
th: ผู้อนุมัติ

source: Status
th: สถานะ

source: Date
th: วันที่อนุมัติ

source: Need Detail
th: รายละเอียดต้องการ

source: Type
th: ประเภท

# doc_type
source: Document type
th: ประเภทของเอกสาร

source: Project
th: โครงการ

source: Department
th: แผนก

source: Subject
th: ชื่อเรื่อง

source: Next
th: ถัดไป

source: No project
th: ไม่มีโครงการ

# warn_need_date
source: Please select date.
th: กรุณาเลือกวันที่

# warn_need_type
source: Please select document type.
th: กรุณาเลือกประเภทของเอกสาร

# warn_need_typerq
source: Please select type.
th: กรุณาเลือกประเภท

# warn_need_project
source: Please select project.
th: กรุณาเลือกโครงการ

# warn_need_depart
source: Please select department.
th: กรุณาเลือกแผนก

# warn_need_subject
source: Please select subject.
th: กรุณาใส่ชื่อเรื่อง

# warn_need_reason
source: Please input reason.
th: กรุณาใส่เหตุผลก่อนทำรายการ

source: Need type
th: ประเภทความต้องการ

source: Detail
th: รายละเอียด

source: Price
th: ราคา

source: Quantity
th: จำนวน

source: Unit
th: หน่วย

source: Total budget
th: งบประมาณทั้งหมด

source: Add photo
th: เพิ่มรูปภาพ

source: Done
th: เสร็จสิ้น

# delete_first_item
source: You can't delete first item.
th: คุณไม่สามารถลบรายการแรกได้

# select_need_type
source: You need to select need type before select or add next item.
th: คุณจำเป็นต้องเลือกประเภทความต้องการก่อนที่จะเลือกหรือเพิ่มรายการถัดไป

source: Preview Image
th: พรีวิวรูปภาพ

# title_approve
source: Approval
th: การอนุมัติ

# doc_no
source: Document No.
th: เลขที่เอกสาร

# rq_user
source: Request user
th: ผู้ร้องขอ

source: Total (Hr.)
th: รวมทั้งหมด(ช.ม.)

source: Approve by
th: อนุมัติโดย

# detail_work
source: Work Detail
th: รายละเอียดการทำงาน

# detail_need
source: Need Detail
th: รายละเอียดความต้องการ

# success_approve_float
source: Approve floating success.
th: อนุมัติการลาทดแทนสำเร็จ

# fail_approve_float
source: Fail to approve floating.
th: อนุมัติการลาทดแทนไม่สำเร็จ

# title_account
source: Account
th: ลูกค้า

# title_project
source: Project
th: โครงการ

# title_contact
source: Contact
th: ติดต่อ

# title_activity
source: Activity
th: กิจกรรม

# Usubject
source: SUBJECT
th: ชื่อเรื่อง

# Utype
source: TYPE
th: ประเภท

# Uproject
source: PROJECT
th: โครงการ

# Ucontact
source: CONTACT
th: ผู้ติดต่อ

# Uaccount
source: ACCOUNT
th: ลูกค้า

# Uplace
source: PLACE
th: สถานที่

# Uactivity_status
source: ACTIVITY STATUS
th: สถานะ

# Uactivity_location
source: ACTIVITY LOCATION
th: สถานที่ตั้ง

# Upriority
source: PRIORITY
th: ระดับสำคัญ

# Ulocation
source: LOCATION
th: สถานที่ตั้ง

# Ucost
source: COST
th: มูลค่า

# Uother_contact
source: OTHER CONTACT
th: ผู้ติดต่ออื่นๆ

# Uphoto_file
source: PHOTO
th: รูปภาพ

# Uskoop
source: SKOOP
th: สกูป

source: Skoop
th: สกูป

source: Upload
th: อัพโหลด

source: Photo
th: รูปภาพ

source: Upload Photo
th: อัพโหลดรูปภาพ

source: Add Activity
th: เพิ่มกิจกรรม

source: Edit Activity
th: แก้ไขกิจกรรม

source: Close Activity
th: ปิดกิจกรรม

source: Delete Activity
th: ลบกิจกรรม

source: Indoor
th: ในสถานที่

source: Outdoor
th: นอกสถานที่

source: Contact
th: ผู้ติดต่อ

source: Account
th: ลูกค้า

source: Cost
th: มูลค่า

source: Other Contact
th: ผู้ติดต่ออื่นๆ

source: Add Other Contact
th: เพิ่มผู้ติดต่ออื่นๆ

source: ACTIVITY LOCATION
th: สถานที่ตั้งกิจกรรม

source: Location name
th: ชื่อสถานที่ตั้ง

source: Subject required.
th: จำเป็นต้องใส่ชื่อเรื่อง

source: Description required.
th: จำเป็นต้องใส่รายละเอียด

source: Type required.
th: จำเป็นต้องเลือกประเภทของกิจกรรม

source: Project required.
th: จำเป็นต้องเลือกโครงการ

source: Contact required.
th: จำเป็นต้องเลือกผู้ติดต่อ

# success_process
source: Successful transaction.
th: ทำรายการสำเร็จ

# fail_process
source: Failed to complete the transaction.
th: ทำรายการไม่สำเร็จ

source: Save
th: บันทึก

# require_field
source: (require)
th: (โปรดระบุ)

source: Confirm delete
th: ยืนยันการลบ

# close_success
source: Close activity success.
th: ปิดกิจกรรมสำเร็จ

# close_fail
source: Fail to close activity.
th: ปิดกิจกรรมไม่สำเร็จ กรุณาติดต่อผู้ดูแล

# close_overlap
source: Fail to close activity. Close time was overlap.
th: ปิดกิจกรรมไม่สำเร็จ เนื่องจากมีการซ้อนทับของเวลาปิดกิจกรรม

# close_incomplete
source: Fail to close activity. Incomplete data.
th: ปิดกิจกรรมไม่สำเร็จ ข้อมูลไม่ครบถ้วน

source: Start date
th: วันที่เริ่มต้น

source: End date
th: วันที่สิ้นสุด

source: Start time
th: เวลาที่เริ่มต้น

source: End time
th: เวลาที่สิ้นสุด

source: Priority
th: ระดับสำคัญ

source: Place
th: สถานที่

source: Signature
th: ลายเซ็นต์

source: Tel
th: โทร

# title_setting
source: Setting
th: ตั้งค่า

source: Languages
th: ภาษา

source: Thai
th: ไทย

source: English
th: อังกฤษ

# button_login
source: Login
th: เข้าสู่ระบบ

# place_email
source: E-Mail
th: อีเมลล์

# place_pass
source: Password
th: รหัสผ่าน

# title_logout
source: Logout
th: ออกจากระบบ

source: Success
th: สำเร็จ

source: Warning
th: แจ้งเตือน

source: Fail
th: ผิดพลาด

source: Close
th: ปิด

source: OK
th: ตกลง

source: Delete
th: ลบ

# cancle
source: Cancel
th: ยกเลิก

source: Back
th: กลับ

# choose_photo
source: Choose a photo
th: เลือกรูปภาพ

# new_photo
source: Take a new photo
th: ถ่ายรูปภาพ

# user_not_found
source: User not found, Please check your username and password again.
th: ไม่พบชื่อผู้ใช้ กรุณาตรวจสอบชื่อผู้ใช้และรหัสผ่านอีกครั้ง

# require_user_pass
source: Require username and password.
th: ต้องการชื่อผู้ใช้และรหัสผ่านเพื่อเข้าสู่ระบบ

source: Account Detail
th: รายละเอียดลูกค้า

source: New Account
th: เพิ่มข้อมูลลูกค้าใหม่

source: Edit Account
th: แก้ไขข้อมูลลูกค้า

# preview_map
source: Preview Location
th: สถานที่ตั้ง

# Umobile
source: MOBILE
th: มือถือ

# Uwork
source: WORK
th: โทร

# Ue_mail
source: E-MAIL
th: อีเมลล์

# Ufax
source: FAX
th: แฟกซ์

# Uowner
source: OWNER
th: ผู้รับผิดชอบ

# Uaddress
source: ADDRESS
th: สถานที่ตั้ง

# Udescription
source: DESCRIPTION
th: รายละเอียด

# Ucompany_size
source: COMPANY SIZE
th: ขนาดองค์กร

# Uregistration
source: REGISTRATION
th: จดทะเบียนบริษัท

# Uregistered_capital
source: REGISTERED CAPITAL
th: ทุนจดทะเบียน

# Unumber_staff
source: NUMBER OF STAFF
th: จำนวนสมาชิกทั้งหมด

# Upayment
source: PAYMENT TERM
th: วิธีการชำระ

# Utax_id
source: TAX ID
th: เลขประจำตัวผู้เสียภาษี

# Uold_code
source: OLD CODE
th: รหัสเก่า

# Uship_to
source: SHIP TO
th: สถานที่จัดส่ง

# Udoc_address
source: DOCUMENT ADDRESS
th: ที่อยู่จัดส่งเอกสาร

# Umap_location
source: MAP LOCATION
th: รูปภาพแผนที่

# more_info
source: More information
th: ข้อมูลเพิ่มเติม

source: Add logo
th: เพิ่มโลโก้

# add_map
source: Add map marker
th: เพิ่มสถานที่ตั้ง

# edit_map
source: Edit map marker
th: แก้ไขสถานที่ตั้ง

# select_map_image
source: Choose map location image
th: เลือกรูปแผนที่สถานที่ตั้ง

# PHcom_en
source: Company Name (EN)
th: ชื่อบริษัท (EN)

# PHcom_th
source: Company Name (TH)
th: ชื่อบริษัท (TH)

# PHgroup
source: Group
th: กลุ่ม

# PHcode
source: Code
th: รหัส

# PHmobile
source: Mobile Number
th: มือถือ

# PHwork
source: Work Number
th: โทร

# PHemail
source: E-Mail
th: อีเมลล์

# PHno
source: No
th: เลขที่

# PHlane
source: Lane
th: ซอย

# PHbuilding
source: Building
th: อาคาร

# PHroad
source: Road
th: ถนน

# PHdistrict
source: District
th: เขต/อำเภอ

# PHsubdistrict
source: Sub District
th: แขวง/ตำบล

# PHprovince
source: Province
th: จังหวัด

# PHpost_code
source: Post Code
th: รหัสไปรษณีย์

# PHcountry
source: Country
th: ประเทศ

# search_place
source: Search for places
th: ค้นหาสถานที่ตั้ง

source: Mark place
th: ชื่อสถานที่ตั้ง

source: Pin
th: เลือก

source: Fax
th: แฟกซ์

# com_size
source: Company Size
th: ขนาดองค์กร

# regist
source: Registration
th: จดทะเบียนบริษัท

# regist_cap
source: Registered Capital
th: ทุนจดทะเบียน

# number_staff
source: Number of staff
th: จำนวนสมาชิกทั้งหมด

source: Payment Term
th: วิธีการชำระ

source: Tax ID
th: เลขประจำตัวผู้เสียภาษี

source: Old Code
th: รหัสเก่า

source: Description
th: รายละเอียด

source: Ship to
th: สถานที่จัดส่ง

# doc_address
source: Document Address
th: ที่อยู่จัดส่งเอกสาร

# search_ship
source: Search ship to
th: ค้นหาสถานที่จัดส่ง

# search_doc
source: Search document address
th: ค้นหาที่อยู่จัดส่งเอกสาร

# choose_map_image
source: Choose map location image
th: เลือกรูปภาพของสถานที่ตั้ง

source: Add account success.
th: เพิ่มรายชื่อลูกค้าใหม่สำเร็จ

source: Update account success.
th: อัพเดตรายชื่อลูกค้าสำเร็จ

source: Delete account success.
th: ลบรายชื่อลูกค้าสำเร็จ

# check_comp_en
source: - The company name (en) is required
th: - จำเป็นต้องใส่ชื่อของบริษัท (th)

# check_comp_th
source: - The company name (th) is required
th: - ขำเป็นต้องใส่ชื่อของบริษัท (en)

# check_work
source: - The tel is require
th: - จำเป็นต้องใส่เบอร์โทร

# check_regist
source: - The registration is require
th: - จำเป็นต้องใส่การจดทะเบียนของบริษัท

# check_type
source: - The type is require
th: - จำเป็นต้องใส่ประเภทของบริษัท

# check_group
source: - The group is require
th: - จำเป็นต้องใส่กลุ่มของบริษัท
